["Amazon: Internships & Full-Time Roles for Batch 2026 Students - Amazon Portal Lin - Apply by EOD 19 June 2025\nAnita Marwaha\n  ·  \n3 hours ago\nAmazon: Internships & Full-Time Roles for Batch 2026 Students apply by 09 AM, 19 June 2025\n BTech/Integrated MTech Batch 2026 Students\n Amazon invites applications from students of Batch 2026 for Internship and Full-Time Opportunities.\n At Amazon, your career journey will be shaped by you—offering opportunities to lead, innovate, and make real impact. You'll work on cutting-edge technology alongside global teams, with a shared mission to delight customers worldwide.\n Whether through an internship or a full-time role, you’ll contribute to projects that touch the lives of millions.\nSee More\nComment", "Open for applications - Richpanel's Job Profile - Fullstack Engineering Intern\nAnurag Srivastava\n  ·  \n18 hours ago\nApplications are now being accepted for Richpanel's Job Profile: Fullstack Engineering Intern.\nEligible students will be able to find this job profile under JOB PROFILES options, and apply.\nApplicable Courses\nB.Tech - CSE, JIIT\nB.Tech - IT, JIIT\nB.Tech - ECE, JIIT\nEligibility\nB.Tech\nUndergraduate - 8.5 CGPA\nNo backlogs\nHiring Process - Stages\nSee More\nComment", "Flipkart Grid 7.0 - Batch 2026 - hiring challenge -SDEs Internships and Full-Time Roles - apply by 10 AM, 19 June 2025\nAnita Marwaha\n  ·  \n19 hours ago\nKind Attn: Students of 2026 Graduating Batches\nFlipkart GRiD is a flagship engineering campus challenge, recognised as India's largest Tech Case Competition. Curated for the best and the brightest engineering students across India, GRiD's legacy has been about more than just a competition - it's where talent meets innovation and entrepreneurship.\n GRiD 7.0, get a chance to leap into Flipkart's World of Maximisation, and explore networking and complex problem solving that is aimed towards some of the finest e-commerce challenges of today. Participants will present their solutions to Flipkart experts, with opportunities for grand prizes, recognition, and job offers.\nEligibility Criteria: This competition is open to students pursuing B.Tech., Integrated and M.Tech. All Branches of the 2026 Batch. No Active Backlogs.\nCareer Opportunities:\nWinter Internship Interview Opportunity for 4th-year bachelor students or equivalent\nFull-Time Interview Opportunity for 4th-year bachelor students or equivalent\nSee More\nComment", "Open for applications - Concept2Action.ai's Job Profile - AI Innovation Incubator (AIII)\nPragati Pragati\n  ·  \n20 hours ago\nApplications are now being accepted for Concept2Action.ai's Job Profile: AI Innovation Incubator (AIII).\nEligible students will be able to find this job profile under JOB PROFILES options, and apply.\nApplicable Courses\nB.Tech - CSE, JIIT\nB.Tech - IT, JIIT\nB.Tech - ECE, JIIT\nM.Tech (Integrated) - ECE, JIIT\nM.Tech (Integrated) - CSE, JIIT\nEligibility\nM.Tech (Integrated)\nClass 12th - 50 PERCENT\nSee More\nComment\n3 Comments\nKARAN Chandrawanshi\n18 hours ago\nLink please\nLike\n  ·  \nReply\nSee More"]